app/controllers/categories_controller.rb

  def show
    @category = Category.where(id: params[:category_id])
    @drinks = Drink.where(category_id: params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 3]]
SELECT "drinks".* FROM "drinks" WHERE "drinks"."category_id" = $1  [["category_id", 1]]