app/controllers/drinks_controller.rb

  def new
    @drink = Drink.new
    @categories_dropdown = Category.all.map { |a| [a.name, a.id] }
---
SELECT "categories".* FROM "categories"

  def create
    @drink = Drink.new(drink_params)
    if @drink.save
---
INSERT INTO "drinks" ("title", "description", "category_id", "alcohol_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Water"], ["description", "Tralalal"], ["category_id", 3], ["alcohol_level", "Low"], ["created_at", "2015-06-22 22:43:31.838970"], ["updated_at", "2015-06-22 22:43:31.838970"]]

  def index
    @drinks = Drink.page(params[:page])
---
SELECT  "drinks".* FROM "drinks" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" LIMIT 25 OFFSET 0) subquery_for_count

  def destroy
    @drink = Drink.find(params[:id])
    @drink.destroy
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 6]]

  def edit
    @drink = Drink.find(params[:id])
    @categories_dropdown = Category.all.map { |a| [a.name, a.id] }
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"

  def update
    @drink = Drink.find(params[:id])
    @drink.update(drink_params)
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "drinks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "drinks"."id" = $4  [["title", "A new, improved title"], ["description", "A new, improved description"], ["updated_at", "2015-06-24 04:05:18.040579"], ["id", 240]]