app/controllers/featured_drinks_controller.rb

SELECT  "drinks".* FROM "drinks" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" LIMIT 25 OFFSET 0) subquery_for_count
---
  def index
    @drinks = Drink.page(params[:page])